; domain
(define (domain transport-paczek)
    (:requirements 
        :strips 
        :typing 
        :negative-preconditions 
        :disjunctive-preconditions
        :conditional-effects
        :action-costs 
    )

    (:types
        location
        package
        vehicle
    )

    (:predicates
        (at ?v - vehicle ?l - location)
        (at-package ?p - package ?l - location)
        (in ?p - package ?v - vehicle)
        (capacity-0 ?v - vehicle)
        (capacity-1 ?v - vehicle)
        (capacity-2 ?v - vehicle)
    )

    (:functions
        (total-cost)
        (travel-time ?from - location ?to - location)
    )

    (:action drive
        :parameters (?v - vehicle ?from - location ?to - location)
        :precondition (and
            (at ?v ?from)
            (not (at ?v ?to))
        )
        :effect (and
            (not (at ?v ?from))
            (at ?v ?to)
            (increase (total-cost) (travel-time ?from ?to))
        )
    )

    (:action load
        :parameters (?p - package ?v - vehicle ?l - location)
        :precondition (and
            (at ?v ?l)
            (at-package ?p ?l)
            (not (in ?p ?v))
            (not (capacity-2 ?v))
        )
        :effect (and
            (not (at-package ?p ?l))
            (in ?p ?v)
            (when (capacity-0 ?v)
                (and
                    (not (capacity-0 ?v))
                    (capacity-1 ?v)
                )
            )
            (when (capacity-1 ?v)
                (and
                    (not (capacity-1 ?v))
                    (capacity-2 ?v)
                )
            )
        )
    )
        

    (:action unload
        :parameters (?p - package ?v - vehicle ?l - location)
        :precondition (and
            (at ?v ?l)
            (in ?p ?v)
        )
        :effect (and
            (not (in ?p ?v))
            (at-package ?p ?l)
            (when (capacity-2 ?v)
                (and
                    (not (capacity-2 ?v))
                    (capacity-1 ?v)
                )
            )
            (when (capacity-1 ?v)
                (and
                    (not (capacity-1 ?v))
                    (capacity-0 ?v)
                )
            )
        )
    )
)

; problem
(define (problem transport-paczek-problem)
    (:domain transport-paczek)

    (:objects
        truck1 - vehicle
        pkg1 pkg2 pkg3 - package
        locA locB locC - location
    )

    (:init
        (at truck1 locA)
        (at-package pkg1 locA)
        (at-package pkg2 locB)
        (at-package pkg3 locC)
        (capacity-0 truck1)

        (= (travel-time locA locB) 5)
        (= (travel-time locB locA) 5)
        (= (travel-time locB locC) 7)
        (= (travel-time locC locB) 7)
        (= (travel-time locA locC) 10)
        (= (travel-time locC locA) 10)

        (= (total-cost) 0)
    )

    (:goal (and
        (at-package pkg1 locB)
        (at-package pkg2 locC)
        (at-package pkg3 locA)
    ))

    (:metric minimize (total-cost))
)

; plan
1. (load pkg1 truck1 loca)
   deleted: (at-package pkg1 loca) (capacity-0 truck1)
   added: (in pkg1 truck1) (capacity-1 truck1)
   goals met: 0 of 3
2. (drive truck1 loca locb)
   deleted: (at truck1 loca)
   added: (at truck1 locb)
   goals met: 0 of 3
3. (load pkg2 truck1 locb)
   deleted: (at-package pkg2 locb) (capacity-1 truck1)
   added: (in pkg2 truck1) (capacity-2 truck1)
   goals met: 0 of 3
4. (unload pkg1 truck1 locb)
   deleted: (in pkg1 truck1) (capacity-2 truck1)
   added: (at-package pkg1 locb) (capacity-1 truck1)
   goals met: 1 of 3
5. (drive truck1 locb loca)
   deleted: (at truck1 locb)
   added: (at truck1 loca)
   goals met: 1 of 3
6. (drive truck1 loca locc)
   deleted: (at truck1 loca)
   added: (at truck1 locc)
   goals met: 1 of 3
7. (load pkg3 truck1 locc)
   deleted: (at-package pkg3 locc) (capacity-1 truck1)
   added: (in pkg3 truck1) (capacity-2 truck1)
   goals met: 1 of 3
8. (unload pkg2 truck1 locc)
   deleted: (in pkg2 truck1) (capacity-2 truck1)
   added: (at-package pkg2 locc) (capacity-1 truck1)
   goals met: 2 of 3
9. (drive truck1 locc loca)
   deleted: (at truck1 locc)
   added: (at truck1 loca)
   goals met: 2 of 3
10. (unload pkg3 truck1 loca)
   deleted: (in pkg3 truck1) (capacity-1 truck1)
   added: (at-package pkg3 loca) (capacity-0 truck1)
   goals met: 3 of 3
